## Introduction to Pandas - DataFrame & Series

In [1]:
import pandas as pd

### Series
''' Pandas series is one dimensional array-obj that can hold any data type.
it is similar to a column in a table.'''

In [3]:
import pandas as pd
data = pd.Series([23,34,46,57,61])
print(data)
print(type(data))

0    23
1    34
2    46
3    57
4    61
dtype: int64
<class 'pandas.core.series.Series'>

In [6]:
# Series from Dictionary
data = pd.Series({'a': 5,'b': 8,'c': 2, 'd': 7})
print(data)

a    5
b    8
c    2
d    7
dtype: int64

In [11]:
data = [31,33,35,37,39]
idx = ['a','c','e','g','i']
pd.Series(data,idx)

a    31
c    33
e    35
g    37
i    39
dtype: int64

### DataFrame
''' DataFrame is a 2D mutable heterogenous tabular data
It can have multiple rows & cols
'''

In [15]:
# DataFrame from dictrionary
import pandas as pd
data = {
    'Name' : ['Lana','Abel','Bella'],
    'Age' : [30,31,25],
    'Place' : ['Malibu','Bay-Area','Hollywood']
}
df = pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age      Place
0   Lana   30     Malibu
1   Abel   31   Bay-Area
2  Bella   25  Hollywood
<class 'pandas.core.frame.DataFrame'>

In [16]:
import numpy as np
n = np.array(df)
print(n)

[['Lana' 30 'Malibu']
 ['Abel' 31 'Bay-Area']
 ['Bella' 25 'Hollywood']]

In [19]:
# Create a DataFrame from list of dictionaries
data = [
    {'Name':'Lana','Age':30,'Place':'Malibu'},
    {'Name':'Judy','Age':23,'Place':'Bay-Area'},
    {'Name':'Natasha','Age':20,'Place':'Pasadena'},
    {'Name':'Sieera','Age':31,'Place':'Silicon-Valley'},
    {'Name':'Heidy','Age':27,'Place':'Hollywood'}
]
df = pd.DataFrame(data)
print(df)

      Name  Age           Place
0     Lana   30          Malibu
1     Judy   23        Bay-Area
2  Natasha   20        Pasadena
3   Sieera   31  Silicon-Valley
4    Heidy   27       Hollywood

In [27]:
# Access elements
data = [
    {'Name':'Lana','Age':30,'Place':'Malibu'},
    {'Name':'Judy','Age':23,'Place':'Bay-Area'},
    {'Name':'Natasha','Age':20,'Place':'Pasadena'},
    {'Name':'Sieera','Age':31,'Place':'Silicon-Valley'},
    {'Name':'Heidy','Age':27,'Place':'Hollywood'}
]
df = pd.DataFrame(data)
df

      Name  Age           Place
0     Lana   30          Malibu
1     Judy   23        Bay-Area
2  Natasha   20        Pasadena
3   Sieera   31  Silicon-Valley
4    Heidy   27       Hollywood

In [34]:
# df['Name']
# type(df['Name'])
# df.loc[3]
# df.iloc[2][2]

Name             Sieera
Age                  31
Place    Silicon-Valley
Name: 3, dtype: object

In [42]:
# Accessing a specific element
df.at[2,'Place']

# Accessing a specific element using iat(row,col)
df.iat[0,2]

'Malibu'

### Data Manipulation with DataFrame

In [100]:
data = [
    {'Name':'Lana','Age':30,'Place':'Malibu'},
    {'Name':'Judy','Age':23,'Place':'Bay-Area'},
    {'Name':'Natasha','Age':20,'Place':'Pasadena'},
    {'Name':'Sieera','Age':31,'Place':'Silicon-Valley'},
    {'Name':'Heidy','Age':27,'Place':'Hollywood'}
]
df = pd.DataFrame(data)
df

      Name  Age           Place
0     Lana   30          Malibu
1     Judy   23        Bay-Area
2  Natasha   20        Pasadena
3   Sieera   31  Silicon-Valley
4    Heidy   27       Hollywood

In [95]:
# Add a col
df['Salary'] = ['60k $','62k $','57k $','71k $','50k $']
df

      Name  Age           Place Salary
0     Lana   30          Malibu  60k $
1     Judy   23        Bay-Area  62k $
2  Natasha   20        Pasadena  57k $
3   Sieera   31  Silicon-Valley  71k $
4    Heidy   27       Hollywood  50k $

In [68]:
# Delete a col

# df.drop('Salary')       # KeyError: "['Salary'] not found in axis"
# axis = 0 is row and axis = 1 is col
# df.drop('Salary',axis = 1) # THIS DOES TEMPORARY REMOVE

      Name  Age           Place
0     Lana   30          Malibu
1     Judy   23        Bay-Area
2  Natasha   20        Pasadena
3   Sieera   31  Silicon-Valley
4    Heidy   27       Hollywood

In [96]:
df.drop('Salary',axis = 1,inplace = True)
df

      Name  Age           Place
0     Lana   30          Malibu
1     Judy   23        Bay-Area
2  Natasha   20        Pasadena
3   Sieera   31  Silicon-Valley
4    Heidy   27       Hollywood

In [101]:
# Operations inside
df['Age'] = df['Age'] + 1
df

      Name  Age           Place
0     Lana   31          Malibu
1     Judy   24        Bay-Area
2  Natasha   21        Pasadena
3   Sieera   32  Silicon-Valley
4    Heidy   28       Hollywood

In [102]:
# Remove a row
df.drop(0,inplace = True)

In [103]:
df

      Name  Age           Place
1     Judy   24        Bay-Area
2  Natasha   21        Pasadena
3   Sieera   32  Silicon-Valley
4    Heidy   28       Hollywood

### How to read csv files in pandas

In [120]:
df1 = pd.read_csv('sales_data.csv')
df1.head(5) # Top 5 elements of the file
# remove print for an organized data visualization

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [121]:
df1.head(3)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card

In [122]:
# Display the data types in each col
print('Data Types:\n',df1.dtypes)
print('\n')

# Describe the dataFrame
print('Statistical Summary:\n',df1.describe())

Data Types:
 Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object


Statistical Summary:
        Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000

In [123]:
df1.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000